// база данных для модальных окон
projects.addModal(
	'Портфолио',
	'Эти модальные окна генерируются сами, используя что-то наподобие внутренней базы данных,написаной на js и натягиваются на написанную мной верстку',
	'./img/projects_prev/1.PNG',
	'./img/project_modal/1.PNG'
);
projects.addModal(
	'electron-приложение',
	`мое приложение созданное при помощи фрэймвока 
	electron.node js, api, ве-интерфейс и дискорд и вижуал студио на этом сделаны работа с json файлами`,
	'./img/projects_prev/2.png',
	'./img/project_modal/2.PNG'
);
projects.addModal(
	'анимированный призрак',
	`Создание анимированного призрака при помощи html5, css3. при создании проекта я Создание анимированного призрака при помощи html5, css3. при создании проекта я столкнулся с задачей изучить создание анимаций на css и использование @keyframesСоздание анимированного призрака при помощи html5, css3. при создании проекта я столкнулся с задачей изучить создание анимаций на css и использование @keyframesСоздание анимированного призрака при помощи html5, css3. при создании проекта я столкнулся с задачей изучить 
	создание анимаций на css и использование @keyframesстолкнулся с задачей изучить создание анимаций на css и использование @keyframes`,
	'./img/projects_prev/3.gif',
	'./img/project_modal/3.PNG'
);
projects.addModal(
	'Верстка лендинга',
	'практика навыков верстки при создании различных лендингов макеты взяты в открытом доступе',
	'./img/project_modal/4.PNG',
	'./img/projects_prev/4.PNG'
);
projects.addModal(
	'Анимация загрузки на сайте',
	'Анимация загрузки на сайте js css @keyframes',
	'./img/projects_prev/5.gif',
	'./img/project_modal/5.PNG'
);
projects.addModal(
	'Игра на unity',
	`разрабатывал небольшую игру кликер ради интереса в unity, в процессе пришлось освоить интерфейс UNITY,
	поработать со спрайтами чтобы добавить персонажа, написать скрипты для добавлния счета сверху и его работы.
	в дальнейшем когда кликер будет доработан ипортирую проект в .apk файл чтобы установить на телефон `,
	'./img/projects_prev/6.png',
	'./img/project_modal/6.png'
);
projects.addModal(
	'Интерактивный сайт',
	`разрабатывал `,
	'./img/projects_prev/7.PNG',
	'./img/project_modal/7.PNG'
);
projects.addModal(
	'Верстка лендинга',
	`разрабатывал `,
	'./img/projects_prev/8.PNG',
	'./img/project_modal/8.PNG'
);
projects.addModal(
	'Интерактивная карта',
	`этот проект будет нести практическую пользу не только мне, но и моим согильдейцам в моей любимой игре`,
	'./img/projects_prev/9.png',
	'./img/project_modal/9.PNG'
);
