// база данных для модальных окон
projects.addModal(
	'Портфолио',
	'Эти модальные окна генерируются сами, используя что-то наподобие внутренней базы данных,написаной на js и натягиваются на написанную мной верстку',
	'./img/projects_prev/1.PNG',
	'./img/project_modal/1.PNG'
);
projects.addModal(
	'electron-приложение',
	'мое приложение созданное при помощи фрэймвока electron.node js, api, ве-интерфейс и дискорд и вижуал студио на этом сделаны работа с json файлами',
	'./img/projects_prev/2.PNG',
	'./img/project_modal/2.PNG'
);
projects.addModal(
	'анимированный призрак',
	'Создание анимированного призрака при помощи html5, css3. при создании проекта я Создание анимированного призрака при помощи html5, css3. при создании проекта я столкнулся с задачей изучить создание анимаций на css и использование @keyframesСоздание анимированного призрака при помощи html5, css3. при создании проекта я столкнулся с задачей изучить создание анимаций на css и использование @keyframesСоздание анимированного призрака при помощи html5, css3. при создании проекта я столкнулся с задачей изучить создание анимаций на css и использование @keyframesстолкнулся с задачей изучить создание анимаций на css и использование @keyframes',
	'./img/projects_prev/3.gif',
	'./img/'
);
projects.addModal(
	'Верстка лендинга',
	'практика навыков верстки при создании различных лендингов макеты взяты в открытом доступе',
	'./img/project_modal/4.PNG',
	'./img/projects_prev/4.PNG'
);
// projects.addModal(
// 	'Верстка лендинга',
// 	'практика навыков верстки при создании различных лендингов макеты взяты в открытом доступе',
// 	'./img/project_modal/4.PNG',
// 	'./img/projects_prev/4.PNG'
// );
